[
  "obsidian-vimrc-support",
  "obsidian-relative-line-numbers",
  "floating-toc",
  "obsidian-dynamic-toc",
  "quick-latex",
  "obsidian-git",
  "creases",
  "obsidian-to-notion",
  "table-editor-obsidian",
  "better-reading-mode"
]